Ran Plan for 3 projects:

1. dir: `module/gcp/instances` workspace: `default`
1. dir: `terragrunt/gcp/staging/instances/backend` workspace: `default`
1. dir: `terragrunt/gcp/staging` workspace: `default`

### 1. dir: `module/gcp/instances` workspace: `default`
**Plan Error**
```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/module/gcp/instances": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/module/gcp/instances": 
time=2023-06-23T15:35:46Z level=error msg=Error reading file at path /root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/module/gcp/instances/terragrunt.hcl: open /root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/module/gcp/instances/terragrunt.hcl: no such file or directory
time=2023-06-23T15:35:46Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `terragrunt/gcp/staging/instances/backend` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v4.70.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "backend"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-11"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "default"
          + subnetwork_project = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging/instances/backend/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging/instances/backend/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/gcp/staging/instances/backend`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.100.31/lock?id=abdulrobby%252Fterraform-batch8%252Fterragrunt%252Fgcp%252Fstaging%252Finstances%252Fbackend%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/gcp/staging/instances/backend`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terragrunt/gcp/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging": 
time=2023-06-23T15:35:51Z level=warning msg=Versioning is not enabled for the remote state GCS bucket terraform-batch8. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging] 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-06-23T15:35:51Z level=error msg=Terraform invocation failed in /root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging
time=2023-06-23T15:35:51Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/abdulrobby/terraform-batch8/10/default/terragrunt/gcp/staging] exit status 1




```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`